runs/pm4f_dbs/0/C_SO4.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C_SO4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;      // no SO4 from Ba-rich inlet
    }
    inlet2
    {
        type            fixedValue;
        value           uniform 1.5;    // 1.5 mM SO4-rich
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    topAndBottom
    {
        type            zeroGradient;
    }
    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
