runs/pm4f_dbs/0/eps.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      eps;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// No dimensions for porosity (scalar field)
dimensions      [0 0 0 0 0 0 0];

// Matrix porosity as default; setFields overwrites fracture cells.
internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }

    topAndBottom
    {
        type            zeroGradient;
    }

    // Default for any other undefined patches
    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //