runs/pm4f_dbs/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
mu              mu [ 1 -1 -1 0 0 0 0 ] 1e-3;
rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
nu              nu [0 2 -1 0 0 0 0] 1e-6;

geochemicalProperties
{
    rhol            rhol [ 1 -3 0 0 0 0 0 ] 1000;

    geochemicalModel mixingPrecipitation;

    mineral (Mineral);

    absolutePermeabilityModel KozenyCarman;
    KozenyCarmanCoeffs
    {
        K0 K0 [0 2 0 0 0 0 0] 3.37e-11;  // fallback if K file missing
    }

    dispersionModel archiesLaw;
    archiesLawCoeffs
    {
        Di   Di   [0 2 -1 0 0 0 0] 1e-9;  // molecular diffusion coeff
        n    1.5;                            // Archie's cementation exponent
    }

    MineralProperties
    {
        rhos rhos [1 -3 0 0 0 0 0] 4480;
        Vm   Vm   [0 0 0 0 0 0 0] 5.21e-5;   // molar volume (dimless, m3/mol equivalent)
        surfaceAreaModel none;
    }

    mixingPrecipitation
    {
        speciesA  C_Ba;
        speciesB  C_SO4;

        // Intrinsic rate constant k [mol/m^2/s]
        // Code dimension [m/s] since mol/m^3 = dimensionless in this framework.
        // k = 10^-7.62 = 2.399e-8 mol/m^2/s
        // The spatially varying specific surface area is read from the As field.
        // Effective rate = k * As [1/s], where As [m^2/m^3] = [1/m].
        k    k    [0 1 -1 0 0 0 0] 2.399e-8;

        // Solubility product in mM^2 (= 10^-9.84 M^2 * 10^6 = 10^-3.84 mM^2)
        Ksp  Ksp  [0 0 0 0 0 0 0]  1.445e-4;

        // Molecular diffusion coefficient [m^2/s]
        Di   Di   [0 2 -1 0 0 0 0] 1e-9;
    }
}

// ************************************************************************* //
