runs/pm4f_dbs/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1e-6;

vertices
(
    // z = 0 plane
    (0 0 0)              // 0
    (2880 0 0)           // 1
    (2880 370 0)         // 2
    (0 370 0)            // 3
    (2880 400 0)         // 4
    (0 400 0)            // 5
    (2880 600 0)         // 6
    (0 600 0)            // 7
    (2880 630 0)         // 8
    (0 630 0)            // 9
    (2880 1000 0)        // 10
    (0 1000 0)           // 11

    // z = 23 plane
    (0 0 23)             // 12
    (2880 0 23)          // 13
    (2880 370 23)        // 14
    (0 370 23)           // 15
    (2880 400 23)        // 16
    (0 400 23)           // 17
    (2880 600 23)        // 18
    (0 600 23)           // 19
    (2880 630 23)        // 20
    (0 630 23)           // 21
    (2880 1000 23)       // 22
    (0 1000 23)          // 23
);

blocks // defining blocks by reffering to face indices in order of counter-clockwise then set number of mesh within each block with respect to each direction
(
    hex (0 1 2 3 12 13 14 15) (144 19 1) simpleGrading (1 1 1)      // block 0: bottom matrix  370 um / 19 = ~19.5 um
    hex (3 2 4 5 15 14 16 17) (144 3 1) simpleGrading (1 1 1)       // block 1: transition     30 um /  3 = 10 um
    hex (5 4 6 7 17 16 18 19) (144 20 1) simpleGrading (1 1 1)      // block 2: fracture      200 um / 20 = 10 um
    hex (7 6 8 9 19 18 20 21) (144 3 1) simpleGrading (1 1 1)       // block 3: transition     30 um /  3 = 10 um
    hex (9 8 10 11 21 20 22 23) (144 19 1) simpleGrading (1 1 1)    // block 4: top matrix    370 um / 19 = ~19.5 um
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 12 15 3)   // Bottom matrix inlet (Ba-rich)
            (9 21 23 11)  // Top matrix inlet (Ba-rich)
        );
    }
    inlet2
    {
        type patch;
        faces
        (
            (5 17 19 7)   // Middle fracture inlet (SO4-rich)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 14 13)   // Block 0 outlet
            (2 4 16 14)   // Block 1 outlet
            (4 6 18 16)   // Block 2 outlet
            (6 8 20 18)   // Block 3 outlet
            (8 10 22 20)  // Block 4 outlet
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 13 12)   // Bottom-side wall (y=0)
            (11 23 22 10) // Top-side wall (y=1000)
            (3 15 17 5)   // Front wall (x=0) between Inlets 1 & 2
            (7 19 21 9)   // Front wall (x=0) between Inlets 2 & 3
        );
    }
    topAndBottom
    {
        type wall;
        faces
        (
            // Bottom plates (z=0) - Normals pointing to -z
            (0 3 2 1)
            (3 5 4 2)
            (5 7 6 4)
            (7 9 8 6)
            (9 11 10 8)
            // Top plates (z=23) - Normals pointing to +z
            (12 13 14 15)
            (15 14 16 17)
            (17 16 18 19)
            (19 18 20 21)
            (21 20 22 23)
        );
    }
);

mergePatchPairs ();