runs/pm4f_dbs/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    "Ys.*"
    {
        solver          diagonal;
        tolerance       1e-9;
        relTol          0;
    }

    "(Y.*)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
        nSweeps         1;
    }

    "C_.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }

    "C_.*Final"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }

    Ci
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
        nSweeps         1;
    }

    CiFinal
    {
        $Ci;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   on;
    nOuterCorrectors    5;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    consistent          yes;
    pRefCell            0;
    pRefValue           0;
    turbOnFinalIterOnly yes;

    outerCorrectorResidualControl
    {
        p
        {
            tolerance    1e-5;
            relTol       1e-6;
        }
    }
}

relaxationFactors
{
    equations
    {
        U               0.7;
        Ci              1;
    }

    fields
    {
        p               1;
    }
}

// ************************************************************************* //
